[
    {
        "me" : {
            "name" : "Samuel",
            "middlename" : "Araujo",
            "lastname" : "De Oliveira",
            "stacks": [
                "C#", ".NET", "ASP.NET", "MySql", "Next.js", "Python", "Flask", "Bootstrap"
            ]
        }
    },
    {
        "text-box" : [
            {
                "about-me" : {
                    "title":"DESENVOLVEDOR FULL-STACK",
                    "stacks":"C# | .NET | ASP.NET | MySql | Next.js | Python | Flask | Bootstrap",
                    "paragraphs":[
                        "Estudante de programação focado em se especializar em desenvolvimento back-end, com ênfase em .NET. Formado como técnico em administração, valorizo a organização e o planejamento como pilares essenciais na construção de projetos. Por isso, busco me constantemente aprimorar meus conhecimentos em arquitetura de software e na aplicação de princípios SOLID.",
                        "Esse aviso indica que a imagem foi identificada como o elemento mais importante no carregamento da página (Largest Contentful Paint - LCP) e recomenda marcar essa imagem com a propriedade priority para otimizar o desempenho, especialmente se ela estiver acima da dobra (above the fold), ou seja, visível imediatamente quando o usuário abre a página."
                    ]
                }
            }
        ]
    },
    {
        "repositorys" : [
            {
                "WebApp" : {
                    "title" : "Reuse",
                    "link" : "https://github.com/x99oly/WebApp",
                    "about" : "Este projeto é uma aplicação para gerenciamento de doações que conecta donors (doadores), PCs (Pontos de Coleta), e CERSAM (entidade que recebe os lotes de doações). O sistema foi desenvolvido em .NET Framework com Razor Pages, seguindo os princípios de Domain-Driven Design (DDD) e utilizando MySQL como banco de dados relacional.",
                    "img" : "/reuse.png"
                },
                "Rouba-Montes" : {
                    "title" : "Rouba Montes",
                    "link" : "https://github.com/x99oly/Rouba-Montes",
                    "about" : "Simulador automático do clássico jogo Rouba-Montes, implementado em C#. O programa simula partidas com múltiplos jogadores, seguindo regras de roubo e descarte de cartas, enquanto registra todas as ações em um log detalhado. Inclui configuração personalizada do jogo, rankings finais e histórico de desempenho dos jogadores.",
                    "img" : "/baralho.jpg"
                },
                "MyHomePage" : {
                    "title" : "Meu site",
                    "link" : "https://github.com/x99oly/MyHomePage",
                    "about" : "Aplicação desenvolvida em Next.js que tem como objetivo expor meus projetos e permitir expressar minhas idéias quanto a área de desenvolvimento de software.",
                    "img" : "/whale.jpg"
                 }
            }
        ]
    }
]